"""
634. 单词矩阵
给出一系列 不重复的单词，找出所有用这些单词能构成的 单词矩阵。
一个有效的单词矩阵是指, 如果从第 k 行读出来的单词和第 k 列读出来的单词相同
(0 <= k < max(numRows, numColumns))，那么就是一个单词矩阵.
例如，单词序列为 ["ball","area","lead","lady"] ,构成一个单词矩阵。因为对于
每一行和每一列，读出来的单词都是相同的。

b a l l
a r e a
l e a d
l a d y
样例
给出单词序列 ["area","lead","wall","lady","ball"]
返回 [["wall","area","lead","lady"],["ball","area","lead","lady"]]
输出包含 两个单词矩阵，这两个矩阵的输出的顺序没有影响(只要求矩阵内部有序)。

给出单词序列 ["abat","baba","atan","atal"]
返回 [["baba","abat","baba","atan"],["baba","abat","baba","atal"]]
输出包含 两个单词矩阵，这两个矩阵的输出的顺序没有影响(只要求矩阵内部有序)。

注意事项
现在至少有一个单词并且不多于1000个单词
所有的单词都有相同的长度
单词的长度最短为 1 最长为 5
每一个单词均由小写字母组成
"""